Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
rue
                        }
                      + tableColumn     = ""
                      + targets         = [
                          + {
                              + expr           = "sum(node_memory_MemFree_bytes{cluster=~\"$cluster\"})"
                              + intervalFactor = 2
                              + legendFormat   = ""
                              + refId          = "A"
                              + step           = 1800
                            },
                        ]
                      + thresholds      = ""
                      + title           = "Total Memory Free"
                      + type            = "singlestat"
                      + valueFontSize   = "80%"
                      + valueMaps       = [
                          + {
                              + op    = "="
                              + text  = "N/A"
                              + value = "null"
                            },
                        ]
                      + valueName       = "current"
                    },
                  + {
                      + cacheTimeout    = null
                      + colorBackground = false
                      + colorValue      = false
                      + colors          = [
                          + "rgba(245, 54, 54, 0.9)",
                          + "rgba(237, 129, 40, 0.89)",
                          + "rgba(50, 172, 45, 0.97)",
                        ]
                      + datasource      = "$server"
                      + editable        = true
                      + error           = false
                      + format          = "bytes"
                      + gauge           = {
                          + maxValue         = 100
                          + minValue         = 0
                          + show             = false
                          + thresholdLabels  = false
                          + thresholdMarkers = true
                        }
                      + gridPos         = {
                          + h = 3
                          + w = 8
                          + x = 16
                          + y = 36
                        }
                      + height          = ""
                      + interval        = null
                      + links           = []
                      + mappingType     = 1
                      + mappingTypes    = [
                          + {
                              + name  = "value to text"
                              + value = 1
                            },
                          + {
                              + name  = "range to text"
                              + value = 2
                            },
                        ]
                      + maxDataPoints   = 100
                      + nullPointMode   = "connected"
                      + nullText        = null
                      + postfix         = ""
                      + postfixFontSize = "50%"
                      + prefix          = ""
                      + prefixFontSize  = "50%"
                      + rangeMaps       = [
                          + {
                              + from = "null"
                              + text = "N/A"
                              + to   = "null"
                            },
                        ]
                      + sparkline       = {
                          + fillColor = "rgba(31, 118, 189, 0.18)"
                          + full      = false
                          + lineColor = "rgb(31, 120, 193)"
                          + show      = true
                        }
                      + tableColumn     = ""
                      + targets         = [
                          + {
                              + expr           = "sum(node_memory_MemAvailable_bytes{cluster=~\"$cluster\"})"
                              + intervalFactor = 2
                              + legendFormat   = ""
                              + refId          = "A"
                              + step           = 1800
                            },
                        ]
                      + thresholds      = ""
                      + title           = "Total Memory Available"
                      + type            = "singlestat"
                      + valueFontSize   = "80%"
                      + valueMaps       = [
                          + {
                              + op    = "="
                              + text  = "N/A"
                              + value = "null"
                            },
                        ]
                      + valueName       = "current"
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "$server"
                      + editable        = true
                      + error           = false
                      + fill            = 1
                      + grid            = {}
                      + gridPos         = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 39
                        }
                      + legend          = {
                          + avg     = false
                          + current = false
                          + max     = false
                          + min     = false
                          + show    = true
                          + total   = false
                          + values  = false
                        }
                      + lines           = true
                      + linewidth       = 2
                      + links           = []
                      + nullPointMode   = "connected"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + expr           = "sum(elasticsearch_thread_pool_active_count{cluster=~\"$cluster\", type!=\"management\"}) by (type)"
                              + format         = "time_series"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "Type: {{ type }}"
                              + refId          = "A"
                              + step           = 240
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = "Thread Pools"
                      + tooltip         = {
                          + msResolution = true
                          + shared       = true
                          + sort         = 0
                          + value_type   = "cumulative"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "$server"
                      + editable        = true
                      + error           = false
                      + fill            = 1
                      + grid            = {}
                      + gridPos         = {
                          + h = 8
                          + w = 12
                          + x = 12
                          + y = 39
                        }
                      + legend          = {
                          + avg     = false
                          + current = false
                          + max     = false
                          + min     = false
                          + show    = true
                          + total   = false
                          + values  = false
                        }
                      + lines           = true
                      + linewidth       = 2
                      + links           = []
                      + nullPointMode   = "connected"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + expr           = "rate(elasticsearch_thread_pool_rejected_count{cluster=~\"$cluster\", type!=\"management\"}[5m])"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "{{ name }} {{ type }}"
                              + refId          = "A"
                              + step           = 240
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = "Thread pool rejections"
                      + tooltip         = {
                          + msResolution = true
                          + shared       = true
                          + sort         = 0
                          + value_type   = "cumulative"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "$server"
                      + fill            = 1
                      + gridPos         = {
                          + h = 9
                          + w = 12
                          + x = 0
                          + y = 47
                        }
                      + legend          = {
                          + avg     = false
                          + current = false
                          + max     = false
                          + min     = false
                          + show    = true
                          + total   = false
                          + values  = false
                        }
                      + lines           = true
                      + linewidth       = 1
                      + links           = []
                      + nullPointMode   = "null"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + bucketAggs     = [
                                  + {
                                      + id       = "2"
                                      + settings = {
                                          + interval = "auto"
                                        }
                                      + type     = "date_histogram"
                                    },
                                ]
                              + dsType         = "elasticsearch"
                              + expr           = "avg(irate(node_cpu_seconds_total{cluster=~\"$cluster\"}[60s])) by(mode) *100"
                              + format         = "time_series"
                              + intervalFactor = 2
                              + legendFormat   = "{{ mode }}"
                              + metric         = "elasticsearch_breakers_tripped"
                              + metrics        = [
                                  + {
                                      + id   = "1"
                                      + type = "count"
                                    },
                                ]
                              + refId          = "A"
                              + step           = 240
                              + timeField      = "failure_tstamp"
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = "Avg. CPU Usage"
                      + tooltip         = {
                          + shared     = true
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "short"
                              + label   = ""
                              + logBase = 1
                              + max     = null
                              + min     = "0"
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + label   = null
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "$server"
                      + editable        = true
                      + error           = false
                      + fill            = 1
                      + grid            = {}
                      + gridPos         = {
                          + h = 9
                          + w = 12
                          + x = 12
                          + y = 47
                        }
                      + legend          = {
                          + alignAsTable = true
                          + avg          = true
                          + current      = true
                          + max          = true
                          + min          = true
                          + rightSide    = false
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines           = true
                      + linewidth       = 2
                      + links           = []
                      + nullPointMode   = "connected"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + expr           = "avg_over_time(elasticsearch_jvm_memory_used_bytes{area=\"heap\",cluster=~\"$cluster\"}[15m]) / elasticsearch_jvm_memory_max_bytes{area=\"heap\",cluster=~\"$cluster\"}"
                              + format         = "time_series"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "{{ name }}"
                              + refId          = "A"
                              + step           = 240
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = "Avg Heap in 15min"
                      + tooltip         = {
                          + msResolution = true
                          + shared       = true
                          + sort         = 0
                          + value_type   = "cumulative"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "percentunit"
                              + label   = ""
                              + logBase = 1
                              + max     = 1
                              + min     = 0
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + label   = null
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = false
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "$server"
                      + editable        = true
                      + error           = false
                      + fill            = 1
                      + grid            = {}
                      + gridPos         = {
                          + h = 8
                          + w = 12
                          + x = 0
                          + y = 56
                        }
                      + legend          = {
                          + alignAsTable = true
                          + avg          = true
                          + current      = true
                          + max          = true
                          + min          = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines           = true
                      + linewidth       = 2
                      + links           = []
                      + nullPointMode   = "connected"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + expr           = "sum(rate(elasticsearch_transport_rx_packets_total{cluster=~\"$cluster\"}[5m]))"
                              + format         = "time_series"
                              + intervalFactor = 2
                              + legendFormat   = "RX"
                              + refId          = "A"
                              + step           = 240
                            },
                          + {
                              + expr           = "sum(rate(elasticsearch_transport_tx_packets_total{cluster=~\"$cluster\"}[5m])) * -1"
                              + format         = "time_series"
                              + intervalFactor = 2
                              + legendFormat   = "TX"
                              + refId          = "B"
                              + step           = 240
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = "RX/TX Rate 5m"
                      + tooltip         = {
                          + msResolution = true
                          + shared       = true
                          + sort         = 0
                          + value_type   = "cumulative"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = "$server"
                      + editable        = true
                      + error           = false
                      + fill            = 1
                      + grid            = {}
                      + gridPos         = {
                          + h = 8
                          + w = 12
                          + x = 12
                          + y = 56
                        }
                      + legend          = {
                          + avg     = false
                          + current = false
                          + max     = false
                          + min     = false
                          + show    = true
                          + total   = false
                          + values  = false
                        }
                      + lines           = true
                      + linewidth       = 2
                      + links           = []
                      + nullPointMode   = "connected"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + expr           = "irate(elasticsearch_jvm_gc_collection_seconds_sum{cluster=~\"$cluster\"}[1m])"
                              + interval       = ""
                              + intervalFactor = 2
                              + legendFormat   = "{{ name }} {{ gc }}"
                              + refId          = "A"
                              + step           = 240
                            },
                        ]
                      + thresholds      = []
                      + timeFrom        = null
                      + timeRegions     = []
                      + timeShift       = null
                      + title           = "GC seconds"
                      + tooltip         = {
                          + msResolution = true
                          + shared       = true
                          + sort         = 0
                          + value_type   = "cumulative"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + buckets = null
                          + mode    = "time"
                          + name    = null
                          + show    = true
                          + values  = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + max     = null
                              + min     = null
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align      = false
                          + alignLevel = null
                        }
                    },
                ]
              + refresh       = "1m"
              + schemaVersion = 16
              + style         = "dark"
              + tags          = [
                  + "infra",
                  + "b2c",
                  + "elastic",
                ]
              + templating    = {
                  + list = [
                      + {
                          + current     = {
                              + text  = "Prometheus"
                              + value = "Prometheus"
                            }
                          + hide        = 0
                          + label       = "Server"
                          + name        = "server"
                          + options     = []
                          + query       = "prometheus"
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + type        = "datasource"
                        },
                      + {
                          + allValue       = null
                          + current        = {}
                          + datasource     = "$server"
                          + definition     = ""
                          + hide           = 0
                          + includeAll     = true
                          + label          = null
                          + multi          = true
                          + name           = "cluster"
                          + options        = []
                          + query          = "label_values(elasticsearch_cluster_health_status,cluster)"
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tags           = []
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                    ]
                }
              + time          = {
                  + from = "now-12h"
                  + to   = "now"
                }
              + timepicker    = {
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                  + time_options      = [
                      + "5m",
                      + "15m",
                      + "1h",
                      + "6h",
                      + "12h",
                      + "24h",
                      + "2d",
                      + "7d",
                      + "30d",
                    ]
                }
              + timezone      = "utc"
              + title         = "Elasticsearch"
              + uid           = "n_nxrE_mk"
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.Gitea must be replaced
-/+ resource "grafana_dashboard" "Gitea" {
      ~ dashboard_id = 8 -> (known after apply)
      ~ folder       = "1" # forces replacement -> (known after apply) # forces replacement
      ~ id           = "0:nNq1Iw5Gz" -> (known after apply)
      ~ slug         = "gitea" -> (known after apply)
      ~ uid          = "nNq1Iw5Gz" -> (known after apply)
      ~ url          = "https://grafana.mvaldes.dev/d/nNq1Iw5Gz/gitea" -> (known after apply)
      ~ version      = 2 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # grafana_dashboard.Homelab must be replaced
-/+ resource "grafana_dashboard" "Homelab" {
      ~ dashboard_id = 10 -> (known after apply)
      ~ folder       = "1" # forces replacement -> (known after apply) # forces replacement
      ~ id           = "0:aAjLzqZgk" -> (known after apply)
      ~ slug         = "monitors" -> (known after apply)
      ~ uid          = "aAjLzqZgk" -> (known after apply)
      ~ url          = "https://grafana.mvaldes.dev/d/aAjLzqZgk/monitors" -> (known after apply)
      ~ version      = 3 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # grafana_dashboard.Node-exporter must be replaced
-/+ resource "grafana_dashboard" "Node-exporter" {
      ~ dashboard_id = 13 -> (known after apply)
      ~ folder       = "1" # forces replacement -> (known after apply) # forces replacement
      ~ id           = "0:rYdddlPWk" -> (known after apply)
      ~ slug         = "node-exporter-full" -> (known after apply)
      ~ uid          = "rYdddlPWk" -> (known after apply)
      ~ url          = "https://grafana.mvaldes.dev/d/rYdddlPWk/node-exporter-full" -> (known after apply)
      ~ version      = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # grafana_dashboard.Redis must be replaced
-/+ resource "grafana_dashboard" "Redis" {
      ~ dashboard_id = 16 -> (known after apply)
      ~ folder       = "1" # forces replacement -> (known after apply) # forces replacement
      ~ id           = "0:RpSjVqWMz" -> (known after apply)
      ~ slug         = "redis" -> (known after apply)
      ~ uid          = "RpSjVqWMz" -> (known after apply)
      ~ url          = "https://grafana.mvaldes.dev/d/RpSjVqWMz/redis" -> (known after apply)
      ~ version      = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # grafana_dashboard.Windows-exporter must be replaced
-/+ resource "grafana_dashboard" "Windows-exporter" {
      ~ dashboard_id = 11 -> (known after apply)
      ~ folder       = "1" # forces replacement -> (known after apply) # forces replacement
      ~ id           = "0:MRxYufggz" -> (known after apply)
      ~ slug         = "windows-node" -> (known after apply)
      ~ uid          = "MRxYufggz" -> (known after apply)
      ~ url          = "https://grafana.mvaldes.dev/d/MRxYufggz/windows-node" -> (known after apply)
      ~ version      = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # grafana_data_source.elasticsearch will be updated in-place
~ resource "grafana_data_source" "elasticsearch" {
        id                       = "3"
      ~ json_data_encoded        = jsonencode(
          ~ {
              - includeFrozen              = false
              - logLevelField              = ""
              - logMessageField            = ""
              - maxConcurrentShardRequests = 5
              - timeField                  = "@timestamp"
                # (2 unchanged attributes hidden)
            }
        )
        name                     = "Elasticsearch"
        # (9 unchanged attributes hidden)
    }

  # grafana_folder.general will be destroyed
  # (because grafana_folder.general is not in configuration)
- resource "grafana_folder" "general" {
      - id                           = "1" -> null
      - prevent_destroy_if_not_empty = false -> null
      - title                        = "Homelab" -> null
      - uid                          = "a91289ba-6d93-4a50-9e78-4aa72d84fd0f" -> null
      - url                          = "https://grafana.mvaldes.dev/dashboards/f/a91289ba-6d93-4a50-9e78-4aa72d84fd0f/homelab" -> null
    }

  # grafana_folder.homelab will be created
+ resource "grafana_folder" "homelab" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Homelab"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

Plan: 8 to add, 1 to change, 7 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p grafana`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.mvaldes.dev/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgrafana%252Fmain)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p grafana`
</details>
Plan: 8 to add, 1 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`